In [698]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [699]:
#bank_dataset = pd.read_csv("bank.csv")
bank_dataset = pd.read_csv("https://raw.githubusercontent.com/manishanker/statistics_ML_jan_2020/master/bank.csv",sep=';')

In [700]:
bank_dataset

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19.0,oct,79.0,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11.0,may,220.0,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16.0,apr,185.0,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3.0,jun,199.0,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5.0,may,226.0,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30.0,jul,329.0,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9.0,may,153.0,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19.0,aug,151.0,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6.0,feb,129.0,4,211,3,other,no
4520,44,NaN,NaN,tertiary,no,1136,yes,yes,NaN,3.0,apr,NaN,2,249,7,other,no

In [701]:
bank_dataset.shape

(4521, 17)

In [702]:
bank_dataset.head(5)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19.0,oct,79.0,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11.0,may,220.0,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16.0,apr,185.0,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3.0,jun,199.0,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5.0,may,226.0,1,-1,0,unknown,no

In [703]:
bank_dataset.tail(5)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
4516,33,services,married,secondary,no,-333,yes,no,cellular,30.0,jul,329.0,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9.0,may,153.0,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19.0,aug,151.0,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6.0,feb,129.0,4,211,3,other,no
4520,44,NaN,NaN,tertiary,no,1136,yes,yes,NaN,3.0,apr,NaN,2,249,7,other,no

In [704]:
bank_dataset.isna().sum()

age          0
job          3
marital      3
education    3
default      0
balance      1
housing      1
loan         0
contact      3
day          1
month        0
duration     2
campaign     0
pdays        0
previous     0
poutcome     0
y            3
dtype: int64

In [705]:
bank_dataset.describe()

,age,day,duration,campaign,pdays,previous
count,4521.000000,4520.000000,4519.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,15.915487,263.984952,2.793630,39.766645,0.542579
std,10.576211,8.248569,259.896301,3.109807,100.121124,1.693562
min,19.000000,1.000000,4.000000,1.000000,-1.000000,0.000000
25%,33.000000,9.000000,104.000000,1.000000,-1.000000,0.000000
50%,39.000000,16.000000,185.000000,2.000000,-1.000000,0.000000
75%,49.000000,21.000000,329.000000,3.000000,-1.000000,0.000000
max,87.000000,31.000000,3025.000000,50.000000,871.000000,25.000000

In [706]:
bank_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
age          4521 non-null int64
job          4518 non-null object
marital      4518 non-null object
education    4518 non-null object
default      4521 non-null object
balance      4520 non-null object
housing      4520 non-null object
loan         4521 non-null object
contact      4518 non-null object
day          4520 non-null float64
month        4521 non-null object
duration     4519 non-null float64
campaign     4521 non-null int64
pdays        4521 non-null int64
previous     4521 non-null int64
poutcome     4521 non-null object
y            4518 non-null object
dtypes: float64(2), int64(4), object(11)
memory usage: 600.6+ KB

In [707]:
#bank_dataset_clean = bank_dataset

In [708]:
bank_dataset['day'].fillna(15.9, inplace=True)

In [709]:
bank_dataset.isna().sum()

age          0
job          3
marital      3
education    3
default      0
balance      1
housing      1
loan         0
contact      3
day          0
month        0
duration     2
campaign     0
pdays        0
previous     0
poutcome     0
y            3
dtype: int64

In [710]:
df_poutcome = pd.get_dummies(bank_dataset['poutcome'])

In [711]:
bank_dataset = pd.concat([bank_dataset, df_poutcome], axis=1)

In [712]:
bank_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 21 columns):
age          4521 non-null int64
job          4518 non-null object
marital      4518 non-null object
education    4518 non-null object
default      4521 non-null object
balance      4520 non-null object
housing      4520 non-null object
loan         4521 non-null object
contact      4518 non-null object
day          4521 non-null float64
month        4521 non-null object
duration     4519 non-null float64
campaign     4521 non-null int64
pdays        4521 non-null int64
previous     4521 non-null int64
poutcome     4521 non-null object
y            4518 non-null object
failure      4521 non-null uint8
other        4521 non-null uint8
success      4521 non-null uint8
unknown      4521 non-null uint8
dtypes: float64(2), int64(4), object(11), uint8(4)
memory usage: 618.2+ KB

In [713]:
bank_dataset.drop(['poutcome'], axis=1, inplace=True)

In [714]:
bank_dataset.drop(['contact'], axis=1, inplace=True)

In [715]:
bank_dataset

,age,job,marital,education,default,balance,housing,loan,day,month,duration,campaign,pdays,previous,y,failure,other,success,unknown
0,30,unemployed,married,primary,no,1787,no,no,19.0,oct,79.0,1,-1,0,no,0,0,0,1
1,33,services,married,secondary,no,4789,yes,yes,11.0,may,220.0,1,339,4,no,1,0,0,0
2,35,management,single,tertiary,no,1350,yes,no,16.0,apr,185.0,1,330,1,no,1,0,0,0
3,30,management,married,tertiary,no,1476,yes,yes,3.0,jun,199.0,4,-1,0,no,0,0,0,1
4,59,blue-collar,married,secondary,no,0,yes,no,5.0,may,226.0,1,-1,0,no,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,30.0,jul,329.0,5,-1,0,no,0,0,0,1
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,9.0,may,153.0,1,-1,0,no,0,0,0,1
4518,57,technician,married,secondary,no,295,no,no,19.0,aug,151.0,11,-1,0,no,0,0,0,1
4519,28,blue-collar,married,secondary,no,1137,no,no,6.0,feb,129.0,4,211,3,no,0,1,0,0
4520,44,NaN,NaN,tertiary,no,1136,yes,yes,3.0,apr,NaN,2,249,7,no,0,1,0,0

In [716]:
bank_dataset['job'].fillna('management', inplace=True)

In [717]:
bank_dataset['marital'].fillna('married', inplace=True)

In [718]:
bank_dataset['education'].fillna('secondary', inplace=True)

In [719]:
bank_dataset['housing'].fillna('yes', inplace=True)

In [720]:
bank_dataset['duration'].fillna(263.9, inplace=True)

In [721]:
bank_dataset['y'].fillna('no', inplace=True)

In [722]:
bank_dataset['balance'].apply(type).value_counts()

<class 'str'>      4520
<class 'float'>       1
Name: balance, dtype: int64

In [723]:
bank_dataset.balance.describe()

count     4520
unique    2352
top          0
freq       357
Name: balance, dtype: object

In [724]:
bank_dataset.describe()

,age,day,duration,campaign,pdays,previous,failure,other,success,unknown
count,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,15.915483,263.984915,2.793630,39.766645,0.542579,0.108383,0.043574,0.028534,0.819509
std,10.576211,8.247656,259.838796,3.109807,100.121124,1.693562,0.310898,0.204169,0.166510,0.384638
min,19.000000,1.000000,4.000000,1.000000,-1.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,33.000000,9.000000,104.000000,1.000000,-1.000000,0.000000,0.000000,0.000000,0.000000,1.000000
50%,39.000000,16.000000,185.000000,2.000000,-1.000000,0.000000,0.000000,0.000000,0.000000,1.000000
75%,49.000000,21.000000,329.000000,3.000000,-1.000000,0.000000,0.000000,0.000000,0.000000,1.000000
max,87.000000,31.000000,3025.000000,50.000000,871.000000,25.000000,1.000000,1.000000,1.000000,1.000000

In [725]:
bank_dataset.job.describe()

count           4521
unique            12
top       management
freq             971
Name: job, dtype: object

In [726]:
bank_dataset.marital.describe()

count        4521
unique          3
top       married
freq         2799
Name: marital, dtype: object

In [727]:
bank_dataset.education.describe()

count          4521
unique            5
top       secondary
freq           2307
Name: education, dtype: object

In [728]:
bank_dataset.housing.describe()

count     4521
unique       2
top        yes
freq      2559
Name: housing, dtype: object

In [729]:
bank_dataset.y.describe()

count     4521
unique       6
top         no
freq      3991
Name: y, dtype: object

In [730]:
bank_dataset.isna().sum()

age          0
job          0
marital      0
education    0
default      0
balance      1
housing      0
loan         0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
y            0
failure      0
other        0
success      0
unknown      0
dtype: int64

In [731]:
bank_dataset['balance'] = bank_dataset['balance'].str.replace('MANI','')

In [732]:
bank_dataset['balance'].fillna(0, inplace=True)

In [733]:
bank_dataset.balance.describe()

count     4521
unique    2353
top          0
freq       357
Name: balance, dtype: object

In [734]:
bank_dataset['balance'].apply(type).value_counts()

<class 'str'>    4520
<class 'int'>       1
Name: balance, dtype: int64

In [735]:
bank_dataset.dtypes

age            int64
job           object
marital       object
education     object
default       object
balance       object
housing       object
loan          object
day          float64
month         object
duration     float64
campaign       int64
pdays          int64
previous       int64
y             object
failure        uint8
other          uint8
success        uint8
unknown        uint8
dtype: object

In [736]:
df_job = pd.get_dummies(bank_dataset['job'])

In [737]:
bank_dataset = pd.concat([bank_dataset, df_job], axis=1)

In [738]:
bank_dataset.drop(['job'], axis=1, inplace=True)

In [739]:
df_marital = pd.get_dummies(bank_dataset['marital'])

In [740]:
bank_dataset = pd.concat([bank_dataset, df_marital], axis=1)

In [741]:
bank_dataset.drop(['marital'], axis=1, inplace=True)

In [742]:
df_education = pd.get_dummies(bank_dataset['education'])

In [743]:
bank_dataset = pd.concat([bank_dataset, df_education], axis=1)

In [744]:
bank_dataset.drop(['education'], axis=1, inplace=True)

In [745]:
bank_dataset.default.describe()

count     4521
unique       2
top         no
freq      4445
Name: default, dtype: object

In [746]:
df_default = pd.get_dummies(bank_dataset['default'])

In [747]:
bank_dataset = pd.concat([bank_dataset, df_default], axis=1)

In [748]:
bank_dataset.drop(['default'], axis=1, inplace=True)

In [749]:
df_housing = pd.get_dummies(bank_dataset['housing'])

In [750]:
bank_dataset = pd.concat([bank_dataset, df_housing], axis=1)

In [751]:
bank_dataset.drop(['housing'], axis=1, inplace=True)

In [752]:
df_loan = pd.get_dummies(bank_dataset['loan'])

In [753]:
bank_dataset = pd.concat([bank_dataset, df_loan], axis=1)

In [754]:
bank_dataset.drop(['loan'], axis=1, inplace=True)

In [755]:
bank_dataset.drop(['month'], axis=1, inplace=True)

In [756]:
bank_dataset = bank_dataset[bank_dataset.balance != '']

In [785]:
bank_dataset_clean.isna().sum()

age              0
balance          0
day              0
duration         0
campaign         0
pdays            0
previous         0
y                0
failure          0
other            0
success          0
unknown          0
admin.           0
blue-collar      0
entrepreneur     0
housemaid        0
management       0
retired          0
self-employed    0
services         0
student          0
technician       0
unemployed       0
unknown          0
divorced         0
married          0
single           0
na               0
primary          0
secondary        0
tertiary         0
unknown          0
no               0
yes              0
no               0
yes              0
no               0
yes              0
dtype: int64

In [758]:
#bank_dataset['y'] = bank_dataset['y'].str.replace('No','no')

In [759]:
#bank_dataset['y'] = bank_dataset['y'].replace(to_replace=['yEs','Yes'],value='yes',inplace=True)

In [760]:
bank_dataset['balance'] = bank_dataset['balance'].astype(float)

In [779]:
#bank_dataset['y'] = bank_dataset['y'].str.replace('No','')

In [797]:
bank_dataset = bank_dataset[bank_dataset.y != 'yEs']

In [806]:
bank_dataset = bank_dataset[bank_dataset.y != 'NO']

In [810]:
bank_dataset = bank_dataset[bank_dataset.y != 'Yes']

In [811]:
bank_dataset.y.describe()

count     4514
unique       2
top         no
freq      3995
Name: y, dtype: object

In [812]:
bank_dataset.y.value_counts()

no     3995
yes     519
Name: y, dtype: int64

In [813]:
bank_dataset

,age,balance,day,duration,campaign,pdays,previous,y,failure,other,...,primary,secondary,tertiary,unknown,no,yes,no,yes,no,yes
0,30,1787.0,19.0,79.0,1,-1,0,no,0,0,...,1,0,0,0,1,0,1,0,1,0
1,33,4789.0,11.0,220.0,1,339,4,no,1,0,...,0,1,0,0,1,0,0,1,0,1
2,35,1350.0,16.0,185.0,1,330,1,no,1,0,...,0,0,1,0,1,0,0,1,1,0
3,30,1476.0,3.0,199.0,4,-1,0,no,0,0,...,0,0,1,0,1,0,0,1,0,1
4,59,0.0,5.0,226.0,1,-1,0,no,0,0,...,0,1,0,0,1,0,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,-333.0,30.0,329.0,5,-1,0,no,0,0,...,0,1,0,0,1,0,0,1,1,0
4517,57,-3313.0,9.0,153.0,1,-1,0,no,0,0,...,0,0,1,0,0,1,0,1,0,1
4518,57,295.0,19.0,151.0,11,-1,0,no,0,0,...,0,1,0,0,1,0,1,0,1,0
4519,28,1137.0,6.0,129.0,4,211,3,no,0,1,...,0,1,0,0,1,0,1,0,1,0
4520,44,1136.0,3.0,263.9,2,249,7,no,0,1,...,0,0,1,0,1,0,0,1,0,1

In [791]:
bank_dataset.dtypes

age                int64
balance          float64
day              float64
duration         float64
campaign           int64
pdays              int64
previous           int64
y                 object
failure            uint8
other              uint8
success            uint8
unknown            uint8
admin.             uint8
blue-collar        uint8
entrepreneur       uint8
housemaid          uint8
management         uint8
retired            uint8
self-employed      uint8
services           uint8
student            uint8
technician         uint8
unemployed         uint8
unknown            uint8
divorced           uint8
married            uint8
single             uint8
na                 uint8
primary            uint8
secondary          uint8
tertiary           uint8
unknown            uint8
no                 uint8
yes                uint8
no                 uint8
yes                uint8
no                 uint8
yes                uint8
dtype: object

In [814]:
X = bank_dataset.drop('y', axis=1)
y = bank_dataset['y']

In [815]:
y.value_counts()

no     3995
yes     519
Name: y, dtype: int64

In [816]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.30)

In [817]:
from sklearn.svm import SVC
svclassifier = SVC(kernel='linear')
svclassifier.fit(X_train,y_train)

SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='auto_deprecated',
    kernel='linear', max_iter=-1, probability=False, random_state=None,
    shrinking=True, tol=0.001, verbose=False)

In [818]:
y_pred = svclassifier.predict(X_test)

In [820]:
from sklearn.metrics import accuracy_score

In [822]:
print(accuracy_score(y_test, y_pred))

0.8988929889298893

In [823]:
from sklearn.metrics import classification_report, confusion_matrix
print(confusion_matrix(y_test,y_pred))
print(classification_report(y_test,y_pred))

[[1182   39]
 [  98   36]]
              precision    recall  f1-score   support

          no       0.92      0.97      0.95      1221
         yes       0.48      0.27      0.34       134

    accuracy                           0.90      1355
   macro avg       0.70      0.62      0.64      1355
weighted avg       0.88      0.90      0.89      1355